jlab-sensing/ENTS-node-firmware/stm32/Src/lora_app.c
/* USER CODE END EF */

void LoRaWAN_Init(void) {
  /* USER CODE BEGIN LoRaWAN_Init_LV */

  /* USER CODE END LoRaWAN_Init_LV */

  /* USER CODE BEGIN LoRaWAN_Init_1 */
  // load the upload interval
  // const UserConfiguration *cfg = UserConfigGet();
  // convert interval to ms
  // TxPeriodicity = (cfg->Upload_interval * 1000);
  // divide by number of sensors
  // TxPeriodicity /= cfg->enabled_sensors_multiple_count;
  // divide by 2 to keep upload buffer empty for failed uploads
  // TxPeriodicity /= 2;
  /* USER CODE END LoRaWAN_Init_1 */

  // initial period set to 10s to allow time sync first
  TxPeriodicity = 10000;

  UTIL_TIMER_Create(&StopJoinTimer, JOIN_TIME, UTIL_TIMER_ONESHOT,
                    OnStopJoinTimerEvent, NULL);

  UTIL_SEQ_RegTask((1 << CFG_SEQ_Task_LmHandlerProcess), UTIL_SEQ_RFU,
                   LmHandlerProcess);

  UTIL_SEQ_RegTask((1 << CFG_SEQ_Task_LoRaSendOnTxTimerOrButtonEvent),
                   UTIL_SEQ_RFU, SendTxData);
  UTIL_SEQ_RegTask((1 << CFG_SEQ_Task_LoRaStoreContextEvent), UTIL_SEQ_RFU,
                   StoreContext);
  UTIL_SEQ_RegTask((1 << CFG_SEQ_Task_LoRaStopJoinEvent), UTIL_SEQ_RFU,
                   StopJoin);

  /* Init Info table used by LmHandler*/
  LoraInfo_Init();

  /* Init the Lora Stack*/
  LmHandlerInit(&LmHandlerCallbacks, APP_VERSION);

  LmHandlerConfigure(&LmHandlerParams);

  /* USER CODE BEGIN LoRaWAN_Init_2 */
  /* USER CODE END LoRaWAN_Init_2 */

  LmHandlerJoin(ActivationType, ForceRejoin);

  // start the tx timer
  UTIL_TIMER_Create(&TxTimer, TxPeriodicity, UTIL_TIMER_ONESHOT, OnTxTimerEvent,
                    NULL);
  UTIL_TIMER_Start(&TxTimer);

  /* USER CODE BEGIN LoRaWAN_Init_Last */

  /* USER CODE END LoRaWAN_Init_Last */
}

/* USER CODE BEGIN PB_Callbacks */

#if 0 // User should remove the #if 0 statement and adapt the below code
// according with his needs
// Note: see stm32wlxx_it.c for all interrupt handlers
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin) {
  // Prevent unused argument(s) compilation warning
  // UNUSED(GPIO_Pin);

  switch (GPIO_Pin) {
    case GPIO_PIN_15:  // PCAP02_INTN_Pin, YF-S201C water flow
      // PCAP02
      // PCAP02_INTN_State = (HAL_GPIO_ReadPin(PCAP02_INTN_GPIO_Port, PCAP02_INTN_Pin) ==
      //               GPIO_PIN_SET); /* low active */
      // if (PCAP02_INTN_State == GPIO_PIN_RESET) {
      //   PCAP02_INTN_Counter += 1;
      // }
      // pulse count incrementer for YF-S201C water flow meter and D10 water meter
      pulse_count++;
      break;
    case USER_BUTTON_Pin:  // user button, TCA9535 IO expander interrupt
      APP_LOG(TS_OFF, VLEVEL_M, "PB13 int (TCA9535)\r\n");
      // if (TCA9535ReadInput(&TCA9535_Reg_map) != HAL_OK){
      //   APP_LOG(TS_OFF, VLEVEL_M, "Failed to read TCA9535 input reg.\r\n");
      // }
      break;
    // case  BUT1_Pin:
    //   /* Note: when "EventType == TX_ON_TIMER" this GPIO is not initialized
    //   */ if (EventType == TX_ON_EVENT)
    //   {
    //     UTIL_SEQ_SetTask((1 << CFG_SEQ_Task_LoRaSendOnTxTimerOrButtonEvent),
    //     CFG_SEQ_Prio_0);
    //   }
    //   break;
    // case  BUT2_Pin:
    //   UTIL_SEQ_SetTask((1 << CFG_SEQ_Task_LoRaStopJoinEvent),
    //   CFG_SEQ_Prio_0); break;
    // case  BUT3_Pin:
    //   UTIL_SEQ_SetTask((1 << CFG_SEQ_Task_LoRaStoreContextEvent),
    //   CFG_SEQ_Prio_0); break;
    default:
      break;
  }
}
#endif

/* USER CODE END PB_Callbacks */

/* Private functions ---------------------------------------------------------*/
/* USER CODE BEGIN PrFD */

/* USER CODE END PrFD */

static void OnRxData(LmHandlerAppData_t *appData, LmHandlerRxParams_t *params) {
  /* USER CODE BEGIN OnRxData_1 */
  if ((appData != NULL) || (params != NULL)) {
    static const char *slotStrings[] = {
        "1", "2", "C", "C Multicast", "B Ping-Slot", "B Multicast Ping-Slot"};

    APP_LOG(TS_OFF, VLEVEL_M,
            "\r\n###### ========== MCPS-Indication ==========\r\n");
    APP_LOG(TS_OFF, VLEVEL_H,
            "###### D/L FRAME:%04d | SLOT:%s | PORT:%d | DR:%d | RSSI:%d | "
            "SNR:%d\r\n",
            params->DownlinkCounter, slotStrings[params->RxSlot], appData->Port,
            params->Datarate, params->Rssi, params->Snr);
    APP_LOG(
        TS_OFF, VLEVEL_H,
        "###### D/L IsMcpsIndication:0x%02X | LoRaMacEventInfoStatus:0x%02X | "
        "LinkCheck:0x%02X | DemodMargin:0x%02X | "
        "NbGateways:0x%02X\r\n",
        params->IsMcpsIndication, params->Status, params->LinkCheck,
        params->DemodMargin, params->NbGateways);

        // saving downlink appData
        saveNewDownlinkData(appData);

        // CommissioningParams skipped.
    switch (appData->Port) {
      // TODO add cases for incoming data on ports
      default:
        APP_LOG(TS_OFF, VLEVEL_H, "OnRxData Port: %u\r\n", appData->Port);
        APP_LOG(TS_OFF, VLEVEL_H, "OnRxData BufferSize: %u\r\n",
                appData->BufferSize);
        APP_LOG(TS_OFF, VLEVEL_H, "OnRxData Buffer (hex): ");
        for (int i = 0; i < appData->BufferSize; i++) {
          APP_LOG(TS_OFF, VLEVEL_H, "%02X", appData->Buffer[i]);
        }
        APP_LOG(TS_OFF, VLEVEL_H, "\r\n");
        break;

      case 2:
        if((appData->Buffer[0] == 0x00) && (appData->BufferSize == 1)){
          // APP_LOG(TS_OFF, VLEVEL_H, "Closing solenoid, Message received: %02X", appData->Buffer[0]);
          SolenoidClose();

        }
        else if ((appData->Buffer[0] == 0x01) && (appData->BufferSize == 1)){
          // APP_LOG(TS_OFF, VLEVEL_H, "Opening solenoid, Message received: %02X", appData->Buffer[0]);
          SolenoidOpen();
        }

        break;
    }
  }
  /* USER CODE END OnRxData_1 */
}

static void SendTxData(void) {
  /* USER CODE BEGIN SendTxData_1 */

  // preconditions

  // local flag for if clock has been synced
  static bool clock_synced = false;

  // Sync clock
  if (!clock_synced) {
    // send request and heck return
    if (LmhpClockSyncAppTimeReq() == LORAMAC_HANDLER_SUCCESS) {
      APP_LOG(TS_OFF, VLEVEL_M, "Clock sync request send successfully\r\n")
      // toggle flag
      clock_synced = true;

      // Stop webserver after 60 seconds
      UserConfigSetupStop(60);

      const UserConfiguration *cfg = UserConfigGet();
      // convert interval to ms
      TxPeriodicity = (cfg->Upload_interval * 1000);
      // divide by number of sensors
      // NOTE John I think this is zero indexed so we need to add 1
      TxPeriodicity /= cfg->enabled_sensors_multiple_count + 1;
      // divide by 2 to keep upload buffer empty for failed uploads
      TxPeriodicity /= 2;

      APP_LOG(TS_OFF, VLEVEL_M, "Upload interval set to %lums\r\n",
              TxPeriodicity);

      // clamp to 10s
      if (TxPeriodicity < 10000) {
        TxPeriodicity = 10000;
        APP_LOG(TS_OFF, VLEVEL_L,
                "Warning : upload interval too low, clamping to 10s\r\n");
      }

      UTIL_TIMER_SetPeriod(&TxTimer, TxPeriodicity);

